lib/xml/updateDispositionsFtp.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:updateDispositionsFtp>
            <!--Optional:-->
            <campaignName>?</campaignName>
            <!--Optional:-->
            <updateSettings>
                <!--Optional:-->
                <allowDataCleanup>?</allowDataCleanup>
                <!--Optional:-->
                <callbackFormat>?</callbackFormat>
                <!--Optional:-->
                <callbackUrl>?</callbackUrl>
                <!--Optional:-->
                <countryCode>?</countryCode>
                <!--Optional:-->
                <failOnFieldParseError>?</failOnFieldParseError>
                <!--Zero or more repetitions:-->
                <fieldsMapping>
                    <columnNumber>?</columnNumber>
                    <!--Optional:-->
                    <fieldName>?</fieldName>
                    <key>?</key>
                </fieldsMapping>
                <!--Optional:-->
                <reportEmail>?</reportEmail>
                <!--Optional:-->
                <separator>?</separator>
                <skipHeaderLine>?</skipHeaderLine>
                <!--Optional:-->
                <commonDispositionValue>?</commonDispositionValue>
                <dispositionColumnNumber>?</dispositionColumnNumber>
                <!--Optional:-->
                <dispositionsUpdateMode>?</dispositionsUpdateMode>
                <updateToCommonDisposition>?</updateToCommonDisposition>
                <warnIfNoCrmMatchFound>?</warnIfNoCrmMatchFound>
            </updateSettings>
            <!--Optional:-->
            <ftpSettings>
                <!--Optional:-->
                <hostname>?</hostname>
                <!--Optional:-->
                <password>?</password>
                <!--Optional:-->
                <path>?</path>
                <!--Optional:-->
                <username>?</username>
            </ftpSettings>
        </ser:updateDispositionsFtp>
    </soapenv:Body>
</soapenv:Envelope>